# pkgs/Brewfile — macOS (and Linuxbrew).
#   brew bundle --file=pkgs/Brewfile
# Re-runnable: brew bundle skips formulae that are already installed.
#
# Mac uses `brew bundle` (not install_package) so the colon-syntax + ubi
# fallback doesn't apply here — homebrew has all of these natively.

tap "tmuxpack/tpack"

# Modern CLI tools
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "starship"
brew "git-delta"
brew "lazygit"
brew "gh"
brew "tealdeer"
brew "navi"
brew "fastfetch"
brew "atuin"
brew "direnv"
brew "tmux-mem-cpu-load"
brew "tmuxinator"
cask "tmuxpack/tpack/tpack"

# Base shell, multiplexer, editors
brew "zsh"
brew "tmux"
brew "vim"
brew "nano"
brew "git"
